LEXICON_RU: {str: str} = {
    '/start': "Привет! Это бот Yar.Merchant. Я помогу вам сделать заказ из-за границы!\n"
              "<b>Пожалуйста воспользуйтесь кнопками</b>",
    '/help': "НАПИСАТЬ ПРИНЦИП ВЗАИМОДЕЙСТВИЯ С БОТОМ И СПИСОК КОММАНД",
    'country_shipper': "Выберите страну из которой хотите сделать заказ",
    'china': 'Китай',
    'usa': 'США',
    'china_instructions': "<b>POIZON</b>: гайд по установке\n"
                          "<b>Taobao:</b> гайд по установке\n"
                          "<b>1688:</b> гайд по установке\n",
    'usa_sites': "<b> Для доставки доступны cледующие сайты:</b>\n"
                 "1) Сайт 1 - site1.com\n"
                 "2) Сайт 2 - site2.com\n"
                 "3) Сайт 3 - site3.com\n",
    "start_order": "Оформить заказ 🛒",
    "reviews": "Отзывы наших клиентов 📢",
    "lists": "Подборки 📝",
    "sites": "Сайты и ресурсы 🧑‍💻",
    "in_stock": "Товар в наличии 📦",
    "faq": "Другой вопрос ❓",
    "faq_desc": "Здесь вы можете получить ответ на часто задаваемые вопросы",
    "ship": "Информация о доставке",
    "restrictions": "Ограничения",
    "contact": "Связаться с администратором",
    "ship_info": "НАПИСАТЬ ИНФОРМАЦИЮ О ДОСТАВКЕ",
    "restrictions_info": "НАПИСАТЬ ИНФОРМАЦИЮ О ОГРАНИЧЕНИЯХ",
    "manage_categories": "Редактировать категории",
    "manage_products": "Редактировать товары" ,
    "create_category": "Добавить категорию",
    "edit_category": "Редактировать категорию",
    "change_category_status": "ВКЛ/ВЫКЛ категории",
    "create_product": "Добавить товар",
    "edit_product": "Изменить товар",
    "change_product_status": "ВКЛ/ВЫКЛ товар",
    "admin_panel": "АДМИН ПАНЕЛЬ",
    "category_panel": "Управление категориями",
    "insert_category_name": "Пожалуйста, введите имя категории\n"
                            "Если передумаете, команда /cancel",
    "added_successfully": "<b>Успешно добавлено</b>",
    "edited_successfully": "<b>Успешно изменено</b>",
    "pls_select_category": "Пожалуйста, выберите категорию товара\n"
                           "Если передумаете, команда /cancel"

}

URLS: {str: str} = {
    "reviews": "https://t.me/yarmerchantfeedback",
    "in_stock": "https://t.me/yarmerchantinstant",
    "contact": "https://t.me/VendeTTaCHE"
}
# START_MESSAGE_BUTTONS: {str: str} = {
#     "start_order": "Оформить заказ 🛒",
#     "reviews": "Отзывы наших клиентов 📢",
#     "lists": "Подборки 📝",
#     "sites": "Сайты и ресурсы 🧑‍💻",
#     "in_stock": "Товар в наличии 📦",
#     "faq": "Другой вопрос ❓"
# }
#
# print(START_MESSAGE_BUTTONS.keys())
